Revit 2024 API
SplitButtonData Constructor
Constructs a new instance of SplitButtonData.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public SplitButtonData(
	string name,
	string text
)
Visual Basic
Public Sub New ( _
	name As String, _
	text As String _
)
Visual C++
public:
SplitButtonData(
	String^ name,
	String^ text
)
Parameters
name
Type: System.String
The internal name of the new button.
text
Type: System.String
Remarks
 This text will be displayed on the button if drop-down is empty. If sub-items are added, then the split button will display the current PushButton's text.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException | Thrown when null is passed for one or more arguments.
Autodesk.Revit.Exceptions.ArgumentException | Thrown when an empty string is passed for one or more arguments.
See Also
SplitButtonData Class
Autodesk.Revit.UI Namespace